README.org
* Arxiv-Spider
This is a spider (or scrawl) to download papers in computer science area in [[http://arxiv.org/][arxiv.org]].
The paper will be used in our prp project.
* How to Use It
First,ensure you have installed python3 in your computer,then download the source code
from github:
#+BEGIN_SRC c
$ git clone https://github.com/cjqw/arxiv-spider ~/arxiv-spider
#+END_SRC
Change the first line to specify your python3 path.
Run the program directly and it will download 10 papers by default.
#+BEGIN_SRC c
$ chmod a+x spider.py
$ ./spider.py
#+END_SRC
To doanload more papers, change the value of max\_pdf to whatever you want.
